package database

type gpColumnDesc struct {
	typ   byte
	name0 string
	name1 string
	desc0 string
	desc1 string
}

// GPJYVALUE()，股票交易数据
// GPJYONE()
var gpbase = []gpColumnDesc{
	{typ: 1, name0: "f10", desc0: "股东户数(户)", name1: "", desc1: ""},
	{typ: 2, name0: "f20", desc0: "龙虎榜买入总计(万元)", name1: "f21", desc1: "龙虎榜卖出总计(万元)"},
	{typ: 3, name0: "f30", desc0: "融资余额(万元)", name1: "f31", desc1: "融券余量(股)"},
	{typ: 4, name0: "f40", desc0: "大宗交易成交均价(元)", name1: "f41", desc1: "大宗交易成交额(万元)"},
	{typ: 5, name0: "f50", desc0: "增减持成交均价(元)", name1: "f51", desc1: "增减持变动股数(股)"},
	{typ: 6, name0: "f60", desc0: "陆股通持股量(股)", name1: "", desc1: ""},
	{typ: 7, name0: "f70", desc0: "陆股通市场净买入(万元)", name1: "", desc1: ""},
	{typ: 8, name0: "f80", desc0: "龙虎榜机构卖方机构个数", name1: "f81", desc1: "龙虎榜机构卖出金额(万元)"},
	{typ: 9, name0: "f90", desc0: "龙虎榜机构买方机构个数", name1: "f91", desc1: "龙虎榜机构买入金额(万元)"},
	{typ: 10, name0: "f100", desc0: "近3月机构调研次数", name1: "f101", desc1: "近3月调研机构数量"},
	{typ: 11, name0: "f110", desc0: "融资买入额(万元)", name1: "f111", desc1: "融资偿还额(万元)"},
	{typ: 12, name0: "f120", desc0: "融券卖出量(股)", name1: "f121", desc1: "融券偿还量(股)"},
	{typ: 13, name0: "f130", desc0: "融资净买入(万元)", name1: "f131", desc1: "融券净卖出(股)"},
	{typ: 14, name0: "f140", desc0: "涨停金额(万元) ", name1: "f141", desc1: "涨停开板次数"},
	{typ: 15, name0: "f150", desc0: "涨跌停状态", name1: "f151", desc1: "封单金额(万元)"}, //涨停取2,曾涨停取1,跌停取-2,曾跌停取-1;跌停和曾跌停时,封单金额取负值
	{typ: 16, name0: "f160", desc0: "总市值(万元)", name1: "", desc1: ""},
	{typ: 17, name0: "f170", desc0: "龙虎榜营业部买入金额(万元)", name1: "f171", desc1: "龙虎榜营业部卖出金额(万元)"},
	{typ: 18, name0: "f180", desc0: "龙虎榜沪深股通买入金额(万元)", name1: "f181", desc1: "龙虎榜沪深股通卖出金额(万元)"},
	{typ: 19, name0: "f190", desc0: "每周无限售股份质押数(万) 有限售股份质押数(万)", name1: "f191", desc1: "每周有限售股份质押数(万)"},
	{typ: 20, name0: "f200", desc0: "每周股票质押比例(%)", name1: "", desc1: ""},
	{typ: 21, name0: "f210", desc0: "股息率(%)", name1: "", desc1: ""},
	{typ: 22, name0: "f220", desc0: "涨跌停封流比", name1: "f221", desc1: "涨跌停封封流比"},
	{typ: 23, name0: "f230", desc0: "拟增持数量(万股)", name1: "f231", desc1: "拟减持数量(万股)"},
	{typ: 24, name0: "f240", desc0: "首次涨停时间", name1: "f241", desc1: "涨停最大封单额(万)"},
	{typ: 25, name0: "f250", desc0: "开盘成交量(手)", name1: "f251", desc1: "盘后固定成交量(手)"},
	{typ: 26, name0: "f260", desc0: "拟增持金额(万元)", name1: "f261", desc1: "拟减持金额(万元)"},
	{typ: 27, name0: "f270", desc0: "市场人气排名", name1: "f271", desc1: "通达信研究行业人气排名"},
	{typ: 28, name0: "f280", desc0: "股票回购均价(元)", name1: "f281", desc1: "股票回购数量(万股)"},
	{typ: 29, name0: "f290", desc0: "是否复牌日", name1: "f291", desc1: "是否更名日"}, //注：是否复牌日说明：0-不是复牌日，n(n>0)-停牌n个交易日之后的复牌日；是否更名日说明：0-未更名，1-常规更名，2-加ST，3-加*ST，4-摘帽，5-其他
	{typ: 30, name0: "f300", desc0: "派息金额(万元)", name1: "f301", desc1: "送转数量(股)"},
	{typ: 31, name0: "f310", desc0: "转融券期初余量(股)", name1: "f311", desc1: "转融券期末余量(股)"},
	{typ: 32, name0: "f320", desc0: "转融券融出数量(股)", name1: "f321", desc1: "转融券融出市值(元)"},
	{typ: 33, name0: "f330", desc0: "跌停金额(万元)", name1: "f331", desc1: "跌停开板次数"},
	{typ: 34, name0: "f340", desc0: "跌停首次跌停时间", name1: "f341", desc1: "跌停最大封单额(万)"},
	{typ: 35, name0: "f350", desc0: "增持数量(股)", name1: "f351", desc1: "减持数量(股)"},
	{typ: 36, name0: "f360", desc0: "竞价涨停买入金额(万元)", name1: "", desc1: ""},
	{typ: 37, name0: "f370", desc0: "龙虎榜上榜类型连续交易日(天)", name1: "", desc1: ""},
}

//SCJYVALUE
/*
市场交易类数据函数，数据编号如下：
1--融资融券       沪深京融资余额(万元) 沪深京融券余额(万元)
2--陆股通资金流入 沪股通流入金额(亿元) 深股通流入金额(亿元)[注：沪股通限制展示2000条数据，深股通展示自20161205以后的数据]
3--沪深京涨停股个数 涨停股个数  曾涨停股个数 [注：该指标展示20160926日之后的数据]
4--沪深京跌停股个数 跌停股个数  曾跌停股个数 [注：该指标展示20160926日之后的数据]
5--上证50股指期货  净持仓(手)[注：该指标展示20171009日之后的数据]
6--沪深300股指期货 净持仓(手) [注：该指标展示20171009日之后的数据]
7--中证500股指期货 净持仓(手) [注：该指标展示20171009日之后的数据]
8--ETF基金规模份额数据 ETF基金规模(亿份) ETF净申赎(亿份)
9--每月新增投资者数量-日期 新增自然人数量（户）新增非自然人数量（户）
10--增减持统计    增持额(万元)  减持额(万元)[注：部分公司公告滞后,造成每天查看的数据可能会不一样]
11--大宗交易      溢价的大宗交易额(万元) 折价的大宗交易额(万元)
12--限售解禁      限售解禁计划额(亿元)  限售解禁股份实际上市金额(亿元)[注：该指标展示201802月之后的数据;部分股票的解禁日期延后，造成不同日期提取的某天的计划额可能不同]
13--分红    市场总分红额(亿元)[注：除权派息日的A股市场总分红额]
14--募资    市场总募资额(亿元)[注：发行日期/除权日期的首发、配股和增发的总募资额]
15--打板资金    封板成功资金(亿元) 封板失败资金(亿元) [注：该指标展示20160926日之后的数据]
16--龙虎榜    买入总金额(亿元) 卖出总金额(亿元)
17--龙虎榜机构数据    买入金额(亿元) 卖出金额(亿元)
18--龙虎榜营业部数据    买入金额(亿元) 卖出金额(亿元)
19--龙虎榜沪深股通数据    买入金额(亿元) 卖出金额(亿元)
20--陆股通净买入    沪股通净买入额(亿元) 深股通净买入额(亿元)
21--每周无限售质押率    深市质押率(%) 沪市质押率(%)[注：该指标展示20180128日之后的数据]
22--每周有限售质押率    深市质押率(%) 沪市质押率(%)[注：该指标展示20180128日之后的数据]
23--连板家数    连板股个数(包含ST和未开板新股)  连板股个数(不含ST股和未开板新股）[注：该指标展示20180319日之后的数据]
24--沪深京涨跌停股个数    涨停股个数(不含ST股和未开板新股) 跌停股个数（不含ST股）[注：该指标展示20160926日之后的数据]
25--融资融券    沪深京融资买入额（万元）沪深京融券卖出量（万股）
26--每周市场质押比     每周市场质押比例（%）[注：该指标展示20180316日之后的数据]
27--央行公开市场净投放    央行公开市场净投放 (亿元)
28--历史A股新高新低数  历史新高A股股票个数 历史新低A股股票个数(上市满一年的股票)
29--120天A股新高新低数 120天新高A股股票个数 120天新低A股股票个数(上市满一年的股票)
30--涨停数据  市场高度(不含ST股和未开板新股)  2板以上涨停个数(不含ST股和未开板新股)[注：该指标展示20180319日之后的数据]
31--涨跌家数   涨家数（剔除停牌）  跌家数（剔除停牌）
32--20天A股新高新低数 20天新高A股股票个数 20天新低A股股票个数(上市满一年的股票)
33--市场总封单金额  涨停封单金额（亿元）跌停封单金额（亿元）[注：该指标展示20160926日之后的数据]
34--涨跌股成交量    上涨股成交量(万手)  下跌股成交量(万手)
35--涨停数据   换手板家数  回封率(%)  [注：两个指标都剔除了未开板新股，换手板家数展示20190605日之后的数据，回封率展示20180927日之后的数据]
36--曾涨跌停股个数	曾涨停股个数(剔除ST股和未开板新股)	曾跌停股个数(剔除ST股) [注：该指标展示20160926日之后的数据]
37--转融券  融出市值(亿元)  期末余额(亿元)
38--ETF基金规模金额数据  ETF基金规模(亿元)  ETF净申赎(亿元)
39--涨跌5%家数  涨幅大于等于5%家数  跌幅大于等于5%家数
40--陆股通成交  陆股通成交总额(亿元) 陆股通成交总笔(万笔)
*/
var scbase = []gpColumnDesc{
	{typ: 1, name0: "f10", desc0: "沪深京融资余额(万元)", name1: "f11", desc1: "沪深京融券余额(万元)"},
	{typ: 2, name0: "f20", desc0: "沪股通流入金额(亿元)", name1: "f21", desc1: "深股通流入金额(亿元)"},
	{typ: 3, name0: "f30", desc0: "涨停股个数", name1: "f31", desc1: "曾涨停股个数"},
	{typ: 4, name0: "f40", desc0: "跌停股个数", name1: "f41", desc1: "曾跌停股个数"},
	{typ: 5, name0: "f50", desc0: "上证50股指期货净持仓(手)", name1: "", desc1: ""},
	{typ: 6, name0: "f60", desc0: "沪深300股指期货净持仓(手)", name1: "", desc1: ""},
	{typ: 7, name0: "f70", desc0: "中证500股指期货净持仓(手)", name1: "", desc1: ""},
	{typ: 8, name0: "f80", desc0: "ETF基金规模(亿份)", name1: "f81", desc1: "ETF净申赎(亿份)"},
	{typ: 9, name0: "f90", desc0: "新增自然人数量(户)", name1: "f91", desc1: "新增非自然人数量(户)"},
	{typ: 10, name0: "f100", desc0: "增持额(万元)", name1: "f101", desc1: "减持额(万元)"},
	{typ: 11, name0: "f110", desc0: "溢价大宗成交额(万元)", name1: "f111", desc1: "折价大宗成交额(万元)"},
	{typ: 12, name0: "f120", desc0: "限售解禁计划额(亿元)", name1: "f121", desc1: "限售解禁实际上市额(亿元)"},
	{typ: 13, name0: "f130", desc0: "市场总分红额(亿元)", name1: "", desc1: ""},
	{typ: 14, name0: "f140", desc0: "市场总募资额(亿元)", name1: "", desc1: ""},
	{typ: 15, name0: "f150", desc0: "打板资金封板成功资金(亿元)", name1: "f151", desc1: "打板资金封板失败资金(亿元)"},
	{typ: 16, name0: "f160", desc0: "龙虎榜买入总金额(亿元)", name1: "f161", desc1: "龙虎榜卖出总金额(亿元)"},
	{typ: 17, name0: "f170", desc0: "龙虎榜机构买入金额(亿元)", name1: "f171", desc1: "龙虎榜机构卖出金额(亿元)"},
	{typ: 18, name0: "f180", desc0: "龙虎榜营业部买入金额(亿元)", name1: "f181", desc1: "龙虎榜营业部卖出金额(亿元)"},
	{typ: 19, name0: "f190", desc0: "龙虎榜沪深股通买入金额(亿元)", name1: "f191", desc1: "龙虎榜沪深股通卖出金额(亿元)"},
	{typ: 20, name0: "f200", desc0: "沪股通净买入额(亿元)", name1: "f201", desc1: "深股通净买入额(亿元)"},
	{typ: 21, name0: "f210", desc0: "深市无限售质押率(%)", name1: "f211", desc1: "沪市无限售质押率(%)"},
	{typ: 22, name0: "f220", desc0: "深市有限售质押率(%)", name1: "f221", desc1: "沪市有限售质押率(%)"},
	{typ: 23, name0: "f230", desc0: "连板股个数(含ST/未开板新股)", name1: "f231", desc1: "连板股个数(不含ST/未开板新股)"},
	{typ: 24, name0: "f240", desc0: "涨停股个数(不含ST/未开板新股)", name1: "f241", desc1: "跌停股个数(不含ST股)"},
	{typ: 25, name0: "f250", desc0: "沪深京融资买入额(万元)", name1: "f251", desc1: "沪深京融券卖出量(万股)"},
	{typ: 26, name0: "f260", desc0: "每周市场质押比例(%)", name1: "", desc1: ""},
	{typ: 27, name0: "f270", desc0: "央行公开市场净投放(亿元)", name1: "", desc1: ""},
	{typ: 28, name0: "f280", desc0: "历史新高股票个数", name1: "f281", desc1: "历史新低股票个数"},
	{typ: 29, name0: "f290", desc0: "120天新高股票个数", name1: "f291", desc1: "120天新低股票个数"},
	{typ: 30, name0: "f300", desc0: "市场高度(不含ST/未开板新股)", name1: "f301", desc1: "2板以上涨停个数(不含ST/未开板新股)"},
	{typ: 31, name0: "f310", desc0: "涨家数(剔除停牌)", name1: "f311", desc1: "跌家数(剔除停牌)"},
	{typ: 32, name0: "f320", desc0: "20天新高股票个数", name1: "f321", desc1: "20天新低股票个数"},
	{typ: 33, name0: "f330", desc0: "涨停封单金额(亿元)", name1: "f331", desc1: "跌停封单金额(亿元)"},
	{typ: 34, name0: "f340", desc0: "上涨股成交量(万手)", name1: "f341", desc1: "下跌股成交量(万手)"},
	{typ: 35, name0: "f350", desc0: "换手板家数", name1: "f351", desc1: "回封率(%)"},
	{typ: 36, name0: "f360", desc0: "曾涨停股个数(剔除ST/未开板新股)", name1: "f361", desc1: "曾跌停股个数(剔除ST股)"},
	{typ: 37, name0: "f370", desc0: "转融券融出市值(亿元)", name1: "f371", desc1: "转融券期末余额(亿元)"},
	{typ: 38, name0: "f380", desc0: "ETF基金规模(亿元)", name1: "f381", desc1: "ETF净申赎(亿元)"},
	{typ: 39, name0: "f390", desc0: "涨幅≥5%家数", name1: "f391", desc1: "跌幅≥5%家数"},
	{typ: 40, name0: "f400", desc0: "陆股通成交总额(亿元)", name1: "f401", desc1: "陆股通成交总笔(万笔)"},
}

//BKJYVALUE
/*
如果是880001总市值，相当于是整个A股市场的数据
5--市盈率TTM   整体法  算术平均
6--市净率MRQ   整体法  算术平均
7--市销率TTM   整体法  算术平均
8--市现率TTM   整体法  算术平均
9--涨跌数   上涨家数  下跌家数
10--板块总市值(亿元)   整体法  算术平均
11--板块流通市值(亿元) 整体法  算术平均
12--涨停数   涨停家数  曾涨停家数[注：该指标展示20160926日之后的数据]
13--跌停数   跌停家数  曾跌停家数[注：该指标展示20160926日之后的数据]
14--涨停数据  市场高度(不含ST股和未开板新股)  2板及以上涨停个数(不含ST股和未开板新股)[注：该指标展示20180319日之后的数据]
15--融资融券  沪深京融资余额(万元)   沪深京融券余额(万元)
16--陆股通资金流入  沪股通流入金额(亿元)  深股通流入金额(亿元) [注：该指标展示20170320日之后的数据]
17--开盘成交金额    开盘成交金额(万元)
18--板块股息率(%)   算数平均  整体法
19--板块自由流通市值（亿元）  整体法  算术平均
*/
var bkbase = []gpColumnDesc{
	{typ: 5, name0: "f50", desc0: "市盈率TTM(整体法)", name1: "f51", desc1: "市盈率TTM(算术平均)"},
	{typ: 6, name0: "f60", desc0: "市净率MRQ(整体法)", name1: "f61", desc1: "市净率MRQ(算术平均)"},
	{typ: 7, name0: "f70", desc0: "市销率TTM(整体法)", name1: "f71", desc1: "市销率TTM(算术平均)"},
	{typ: 8, name0: "f80", desc0: "市现率TTM(整体法)", name1: "f81", desc1: "市现率TTM(算术平均)"},
	{typ: 9, name0: "f90", desc0: "上涨家数", name1: "f91", desc1: "下跌家数"},
	{typ: 10, name0: "f100", desc0: "板块总市值(亿元,整体法)", name1: "f101", desc1: "板块总市值(亿元,算术平均)"},
	{typ: 11, name0: "f110", desc0: "板块流通市值(亿元,整体法)", name1: "f111", desc1: "板块流通市值(亿元,算术平均)"},
	{typ: 12, name0: "f120", desc0: "涨停家数", name1: "f121", desc1: "曾涨停家数"},
	{typ: 13, name0: "f130", desc0: "跌停家数", name1: "f131", desc1: "曾跌停家数"},
	{typ: 14, name0: "f140", desc0: "市场高度(不含ST/未开板新股)", name1: "f141", desc1: "2板及以上涨停个数(不含ST/未开板新股)"},
	{typ: 15, name0: "f150", desc0: "沪深京融资余额(万元)", name1: "f151", desc1: "沪深京融券余额(万元)"},
	{typ: 16, name0: "f160", desc0: "沪股通流入金额(亿元)", name1: "f161", desc1: "深股通流入金额(亿元)"},
	{typ: 17, name0: "f170", desc0: "开盘成交金额(万元)", name1: "", desc1: ""},
	{typ: 18, name0: "f180", desc0: "板块股息率(算术平均)", name1: "f181", desc1: "板块股息率(整体法)"},
	{typ: 19, name0: "f190", desc0: "板块自由流通市值(亿元,整体法)", name1: "f191", desc1: "板块自由流通市值(亿元,算术平均)"},
}
